Конструктор_документов/src/Catalogs/ВидыВнутреннихДокументов/ВидыВнутреннихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыВнутреннихДокументов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АвтоматическиВестиСоставУчастниковРабочейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПодписания</name>
    <type>
      <types>EnumRef.ВариантыПодписания</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоАдресатам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоКонтрагентам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоНоменклатуреДел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСтатьямДДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетСторон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетТоваровИУслуг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключенУчетПоНоменклатуреДел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьСозданиеДокументовНеПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПодписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокИсполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЭтапыОбработкиДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаПечатьШтрихкода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенФайлОригинала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнениеРабочихГруппДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеУказаниеОтветственного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписыватьРезолюцииЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНумератор</name>
    <type>
      <types>CatalogRef.Нумераторы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСпособНумерации</name>
    <type>
      <types>EnumRef.СпособыНумерации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНедействующиеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСрокДействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСуммуДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяДоговором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяКомплектомДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Конструктор_документов/src/Catalogs/кпдРазделыДокументов/кпдРазделыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кпдРазделыДокументов</name>
  <owners>Catalog.кпдКонструкторДокументов</owners>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Варианты</name>
    <attributes>
      <name>НазваниеВарианта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФайлСсылка</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоАвтозаполнения</name>
      <type>
        <types>CatalogRef.ПравилаАвтозаполненияФайлов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конструктор_документов/src/Catalogs/ВидыВнутреннихДокументов/Forms/кпдКонструкторДокументов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	кпдРазделыДокументов.Ссылка КАК Раздел,
	|	кпдРазделыДокументовВарианты.НазваниеВарианта,
	|	кпдРазделыДокументов.Наименование,
	|	кпдРазделыДокументовВарианты.НомерСтроки
	|ИЗ
	|	Справочник.кпдРазделыДокументов.Варианты КАК кпдРазделыДокументовВарианты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.кпдРазделыДокументов КАК кпдРазделыДокументов
	|		ПО кпдРазделыДокументовВарианты.Ссылка = кпдРазделыДокументов.Ссылка
	|ГДЕ
	|	НЕ кпдРазделыДокументов.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Раздел
	|ИТОГИ ПО
	|	Раздел";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРаздел = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НомерРаздела = 1;
	Пока ВыборкаРаздел.Следующий() Цикл
		
		////Добавляем группировку
		//ЭлементГруппировки = ЭтаФорма.Элементы.Добавить("Группировка"+ Строка(НомерРаздела), Тип("ГруппаФормы"), ЭтаФорма);
		
		//Добавляем реквизит
		нРеквизиты = Новый Массив;
		Реквизит = Новый РеквизитФормы(ВыборкаРаздел.Наименование, Новый ОписаниеТипов("Строка"), , "Раздел " + Строка(ВыборкаРаздел.Наименование), Истина);
		нРеквизиты.Добавить(Реквизит);
		ИзменитьРеквизиты(нРеквизиты);
		
		//Добавляем поле ввода
		Элемент = ЭтаФорма.Элементы.Добавить(ВыборкаРаздел.Наименование, Тип("ПолеФормы"), ЭтаФорма);
		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
		Элемент.ПутьКДанным = Строка(ВыборкаРаздел.Наименование);
		
		ВыборкаДетальныеЗаписи = ВыборкаРаздел.Выбрать();
		НомерЭлемента = 1;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НомерЭлемента = 1 Тогда	
				//Добавляем реквизит
				нРеквизиты = Новый Массив;
				Реквизит = Новый РеквизитФормы(Строка(ВыборкаРаздел.Наименование)+"ВариантРаздела", Новый ОписаниеТипов("Строка"), , "Варианты раздела: ", Истина);
				нРеквизиты.Добавить(Реквизит);
				ИзменитьРеквизиты(нРеквизиты);
				
				//Добавляем поле ввода
				Элемент = ЭтаФорма.Элементы.Добавить(Строка(ВыборкаРаздел.Наименование)+Строка(ВыборкаДетальныеЗаписи.НазваниеВарианта), Тип("ПолеФормы"), ЭтаФорма);
				Элемент.Вид = ВидПоляФормы.ПолеПереключателя;
				Элемент.ПутьКДанным = Строка(ВыборкаРаздел.Наименование)+"ВариантРаздела";
				Элемент.СписокВыбора.добавить(ВыборкаДетальныеЗаписи.НазваниеВарианта,Строка(ВыборкаДетальныеЗаписи.НазваниеВарианта));
			Иначе
				Элемент.СписокВыбора.добавить(ВыборкаДетальныеЗаписи.НазваниеВарианта,Строка(ВыборкаДетальныеЗаписи.НазваниеВарианта));
			КонецЕсли;
			НомерЭлемента = НомерЭлемента + 1;
		КонецЦикла;
		НомерРаздела = НомерРаздела + 1;
		
	КонецЦикла;
	
	//Добавляем команду
	Элемент2 = ЭтаФорма.Элементы.Добавить("Кнопка1", Тип("КнопкаФормы"), ЭтаФорма);
	Элемент2.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Элемент2.ИмяКоманды = "Сформировать";
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
		Для Каждого Элемент из Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") И Элемент.Вид = ВидПоляФормы.ПолеНадписи Тогда
			Раздел = Элемент.имя;
			
			Для Каждого Элемент из Элементы Цикл
				Если ТипЗнч(Элемент) = Тип("ПолеФормы") И Элемент.Вид = ВидПоляФормы.ПолеПереключателя Тогда
					РезультатПоиска = СтрНайти(Элемент.имя, Раздел);
					Если РезультатПоиска <> 0 Тогда 
						ИмяРеквизита = Раздел + "ВариантРаздела"; 
						ЗначениеРеквизита = ЭтотОбъект.ЭтаФорма[ИмяРеквизита];
						НовСтрока = ВариантыРазделов.Добавить();
						НовСтрока.Раздел = Раздел;
						НовСтрока.ВариантРаздела = ЗначениеРеквизита;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	

	//ЭтаФорма.Закрыть();	
	
КонецПроцедуры
